//This query looks at the justification descriptions given for self approval per role. use this to check users are PIM'ing up for the right roles for the right tasks
AuditLogs
| where OperationName == "Add member to role requested (PIM activation)"
| extend Role = tostring(TargetResources[0].displayName)
| summarize count() by ResultReason , tostring(parse_json((InitiatedBy.user)).userPrincipalName), Role
