AADSignInEventsBeta
| join kind=leftouter IdentityInfo on AccountUpn 
| summarize arg_max(LastPasswordChangeTimestamp,*) by AccountUpn, CreatedDateTime //Maximize last password change time
| project AccountUpn, CreatedDateTime, LastPasswordChangeTimestamp
